mycarenet-ws/src/test/resources/ws-security-example.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1">
            <wsu:Timestamp wsu:Id="TS-DB654FA97D83C1E7F717023658156432">
                <wsu:Created>2023-12-12T07:23:35.643Z</wsu:Created>
                <wsu:Expires>2023-12-12T07:28:35.643Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-DB654FA97D83C1E7F717023658156401">
                <wsse:Username>username</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
            </wsse:UsernameToken>
            <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-DB654FA97D83C1E7F717023658157173">MIIB8jCCAVugAwIBAgIBATANBgkqhkiG9w0BAQUFADA/MRwwGgYDVQQDDBNNeUNhcmVuZXRTZXNzaW9uS2V5MRIwEAYDVQQKDAlNeUNhcmVOZXQxCzAJBgNVBAYTAkJFMB4XDTIzMTIxMjA3MjMzNVoXDTIzMTIxMjA4MjMzNVowPzEcMBoGA1UEAwwTTXlDYXJlbmV0U2Vzc2lvbktleTESMBAGA1UECgwJTXlDYXJlTmV0MQswCQYDVQQGEwJCRTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAwCRioT6cdHaqERSU7nqSY02ofaVT37nnr2Wo3IRURSgcw/Xzsr7F23fM6SMX0ElmPJ183KUentn7i19/EbXYK/WOuC+o6C0vdjS1LloD6o3lHVgz+yw31huDmsmNWQmAZtY/ZtOlLmtlmi6t4jabLHq3DtAq2wPlHb6EcLTUS98CAwEAATANBgkqhkiG9w0BAQUFAAOBgQAA8k4eL6F5exxQKy7ZS0Vhs/tzpWE3EvIYjZFQ5GoJWPgHAHXkOA1usLUbm+GO27Q1F1tzjTDWR6XIeK5DtEIsaGAghyX8wBQqjSnCk7d/qReTDrkKFrIJaj9SXJTPoxdJt+MK0FEtGTd6M2UiJJ0KWUlzUslhOwm1DwrdxuscSQ==</wsse:BinarySecurityToken>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-DB654FA97D83C1E7F717023658157257">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#TS-DB654FA97D83C1E7F717023658156432">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>N45Bavy6IQ2EUjt7Q5wmPgYjXs8=</ds:DigestValue>
                    </ds:Reference>
                    <ds:Reference URI="#UsernameToken-DB654FA97D83C1E7F717023658156401">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>IcSboDcFqpK/J/mN3W3gJkPytpI=</ds:DigestValue>
                    </ds:Reference>
                    <ds:Reference URI="#id-DB654FA97D83C1E7F717023658157236">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>u9/+weOVXuroP/J5TB7Mi6bFwws=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>sivcA5d+1dqA/E8my6Ye4cggHc2Ia2VplFvMb4bUv4AeikkZFCeFlrWZ7o4lxJgCfpG/Y44BoqgGenuPL6GXcgd6c3pC928tUHGDuDOitnT1ViVD7MVDo5NzzLwI19ndLmvdfViVyxsNnu2aL0lh+GCZ3+cF/G4ZHjhi+0l/pV8=</ds:SignatureValue>
                <ds:KeyInfo Id="KI-DB654FA97D83C1E7F717023658157184">
                    <wsse:SecurityTokenReference wsu:Id="STR-DB654FA97D83C1E7F717023658157195">
                        <wsse:Reference URI="#X509-DB654FA97D83C1E7F717023658157173" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-DB654FA97D83C1E7F717023658157236">
        <Test xmlns="http://www.example.com"/>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>